# Pandas

## Pandas which is used for data manipulation and analysis in Python. It provides data structures like Series and DataFrame to handle structured data efficiently.

## importing pandas library

In [1]:
import pandas as pd

## Basic Series creation

In [5]:
series = pd.Series([1,2,3,4,5],index=['A','B','C','D','E'])
series

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [3]:
series = pd.Series((1,2,3,4,5),index=['A','B','C','D','E'])
series

A    1
B    2
C    3
D    4
E    5
dtype: int64

## Set is unordered collection so not possible

In [ ]:
series = pd.Series({1,2,3,4,5},index=['A','B','C','D','E'])
series

In [9]:
series = pd.Series({'A':1,'B':2,'C':3,'D':4,'E':5},index=['A','B','C','D','E'])
series

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [7]:
pd.Series({"Name":['AA','BB'],"Name1":['AA']})

Name     [AA, BB]
Name1        [AA]
dtype: object

## DataFrame Creation:-

## Syntax:-
## pd.DataFrame(dict)

In [ ]:
data = pd.DataFrame({'Name':['Batman','Captain America'],'Role':['Leader','Captain']})
data

              Name     Role
0           Batman   Leader
1  Captain America  Captain

In [8]:
data = pd.DataFrame({'Name':['David Warner','Kane Williamson','Yuvaraj Singh','Shikwar Dhawan',
                             'Aiden Markaram','Pat Cummins','Henrich Klassen','Abishek Sharma',
                             'Nithish Kumar','Bhuvaneshwar Kumar','Travis Head'],
                     'Country':['Aus','NZ','Ind','Ind','SA','Aus','SA','Ind','Ind','Ind','Aus']})
data

                  Name Country
0         David Warner     Aus
1      Kane Williamson      NZ
2        Yuvaraj Singh     Ind
3       Shikwar Dhawan     Ind
4       Aiden Markaram      SA
5          Pat Cummins     Aus
6      Henrich Klassen      SA
7       Abishek Sharma     Ind
8        Nithish Kumar     Ind
9   Bhuvaneshwar Kumar     Ind
10         Travis Head     Aus

In [9]:
data = pd.DataFrame([[1,2],[4,5]],columns=['col1','col2'])
data

   col1  col2
0     1     2
1     4     5

# Data Extraction

## Loading Dataset

### read_csv()
### read_excel()
### read_json()
### read_sql()
### read_html()

In [2]:
"""
    syntax:-
    pd.read_csv(filepath/filename) --> returns data frame
"""

data = pd.read_csv('StudentsPerformance.csv')
data

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

## dataframe.info()

In [12]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

## dataframe.shape

### shape is variable not method

In [13]:
print(data.shape)

(1000, 8)

## columns

### it is also variable not method

In [14]:
print(data.columns)

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

## dtypes

### it is also variable not method

In [15]:
print(data.dtypes)

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [ ]:
## need to print only object types

## dataframe.head()

In [16]:
data.head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
7,male,group B,some college,free/reduced,none,40,43,39
8,male,group D,high school,free/reduced,completed,64,64,67
9,female,group B,high school,free/reduced,none,38,60,50

## dataframe.tail()

### default 5

In [17]:
data.tail(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
990,male,group E,high school,free/reduced,completed,86,81,75
991,female,group B,some high school,standard,completed,65,82,78
992,female,group D,associate's degree,free/reduced,none,55,76,76
993,female,group D,bachelor's degree,free/reduced,none,62,72,74
994,male,group A,high school,standard,none,63,63,62
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

## dataframe.describe()

### by default it gives summary for numerical values by default

In [18]:
data.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [16]:
data.describe(include='all')

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
count,1000,1000,1000,1000,1000,1000.00000,1000.000000,1000.000000
unique,2,5,6,2,2,NaN,NaN,NaN
top,female,group C,some college,standard,none,NaN,NaN,NaN
freq,518,319,226,645,642,NaN,NaN,NaN
mean,NaN,NaN,NaN,NaN,NaN,66.08900,69.169000,68.054000
std,NaN,NaN,NaN,NaN,NaN,15.16308,14.600192,15.195657
min,NaN,NaN,NaN,NaN,NaN,0.00000,17.000000,10.000000
25%,NaN,NaN,NaN,NaN,NaN,57.00000,59.000000,57.750000
50%,NaN,NaN,NaN,NaN,NaN,66.00000,70.000000,69.000000
75%,NaN,NaN,NaN,NaN,NaN,77.00000,79.000000,79.000000
max,NaN,NaN,NaN,NaN,NaN,100.00000,100.000000,100.000000

In [19]:
data.describe(include='object')

,gender,race/ethnicity,parental level of education,lunch,test preparation course
count,1000,1000,1000,1000,1000
unique,2,5,6,2,2
top,female,group C,some college,standard,none
freq,518,319,226,645,642

## Select a Particular Coulumn

In [20]:
""" 
DataFrame['columnname'] --> returns Series

"""

data['gender']

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

## selecting multiple columns for that we use 2-D

In [21]:
data[['gender','lunch']]

     gender         lunch
0    female      standard
1    female      standard
2    female      standard
3      male  free/reduced
4      male      standard
..      ...           ...
995  female      standard
996    male  free/reduced
997  female  free/reduced
998  female      standard
999  female  free/reduced

[1000 rows x 2 columns]

## filter the rows by using conditions

In [17]:
data['gender'] == 'male'

0      False
1      False
2      False
3       True
4       True
       ...
995    False
996     True
997    False
998    False
999    False
Name: gender, Length: 1000, dtype: bool

In [23]:
## from the above returns true,false we need to get values for that

filter_data = data[data['gender'] == 'female']
filter_data

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
...,...,...,...,...,...,...,...,...
993,female,group D,bachelor's degree,free/reduced,none,62,72,74
995,female,group E,master's degree,standard,completed,88,99,95
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [ ]:
## from this dataframe sumation of math score for male and female
## and average math score for male and female

In [53]:
data[data['gender'] == 'male']['math score'].mean()

68.72821576763485

In [47]:
data[data['gender'] == 'male']['math score'].sum()

33127

In [30]:
data.groupby('gender')['math score'].sum()

gender
female    32962
male      33127
Name: math score, dtype: int64

In [33]:
data.groupby('gender')['math score'].mean()

gender
female    63.633205
male      68.728216
Name: math score, dtype: float64

In [26]:
data.groupby('gender')['math score'].agg(['sum', 'mean'])

          sum       mean
gender
female  32962  63.633205
male    33127  68.728216

## iloc
## which is index based slicing

In [19]:
data.iloc[0]

gender                                    female
race/ethnicity                           group B
parental level of education    bachelor's degree
lunch                                   standard
test preparation course                     none
math score                                    72
reading score                                 72
writing score                                 74
Name: 0, dtype: object

In [6]:
data.iloc[0,5] # 0th row and 5th column filteration
# to select a particular/single value from a dataframe

72

In [22]:
data.iloc[:,0]

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

In [8]:
data.iloc[1:11,2:5]

   parental level of education         lunch test preparation course
1                 some college      standard               completed
2              master's degree      standard                    none
3           associate's degree  free/reduced                    none
4                 some college      standard                    none
5           associate's degree      standard                    none
6                 some college      standard               completed
7                 some college  free/reduced                    none
8                  high school  free/reduced               completed
9                  high school  free/reduced                    none
10          associate's degree      standard                    none

In [25]:
data.iloc[[0,2,4,6]] # if use (:) it will be slicing and here inside list another list so it is consider as a one data and it was row and here we calling 0th and 2nd row so it returns oth and 2nd row

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
2,female,group B,master's degree,standard,none,90,95,93
4,male,group C,some college,standard,none,76,78,75
6,female,group B,some college,standard,completed,88,95,92

In [12]:
data.iloc[[0,2],[1,2]]

  race/ethnicity parental level of education
0        group B           bachelor's degree
2        group B             master's degree

## loc

## it works with rows but not coloumns

In [15]:
data.loc[0]

gender                                    female
race/ethnicity                           group B
parental level of education    bachelor's degree
lunch                                   standard
test preparation course                     none
math score                                    72
reading score                                 72
writing score                                 74
Name: 0, dtype: object

In [18]:
data.loc[[0,5]]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
5,female,group B,associate's degree,standard,none,71,83,78

In [20]:
data.loc[1:5]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78

In [32]:
data.loc[0:4,:]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

## iloc is used for index based slicing
## loc is used for label base slicing

In [36]:
# data.loc[1:10,0] # key error : 0
# looking for 0 column name

In [ ]:
data.loc[1:10,['gender','lunch']]

# if we pass like this data.loc[1:10,'gender','lunch'] it becomes index error because in loc and i loc we can't pass more that 2 only rows and columns

    gender         lunch
1   female      standard
2   female      standard
3     male  free/reduced
4     male      standard
5   female      standard
6   female      standard
7     male  free/reduced
8     male  free/reduced
9   female  free/reduced
10    male      standard

## query

In [54]:
data.query('gender == "female"')

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
...,...,...,...,...,...,...,...,...
993,female,group D,bachelor's degree,free/reduced,none,62,72,74
995,female,group E,master's degree,standard,completed,88,99,95
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [57]:
is_male = data['gender'] == 'male'
is_female = data['gender'] == 'female'

male_mean = data.loc[is_male, 'math score'].mean()
female_mean = data.loc[is_female, 'math score'].mean()
male_count = is_male.sum()
female_count = is_female.sum()

In [61]:
data[(data['gender'] == 'female') & (data['lunch'] == 'standard')]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
...,...,...,...,...,...,...,...,...
984,female,group C,some high school,standard,none,74,75,82
986,female,group C,associate's degree,standard,none,40,59,51
991,female,group B,some high school,standard,completed,65,82,78
995,female,group E,master's degree,standard,completed,88,99,95
998,female,group D,some college,standard,completed,68,78,77

In [62]:
data.query('(gender == "male") & (lunch == "standard")')

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
4,male,group C,some college,standard,none,76,78,75
10,male,group C,associate's degree,standard,none,58,54,52
11,male,group D,associate's degree,standard,none,40,52,43
13,male,group A,some college,standard,completed,78,72,70
16,male,group C,high school,standard,none,88,89,86
...,...,...,...,...,...,...,...,...
981,male,group D,some high school,standard,none,81,78,78
982,male,group B,some high school,standard,completed,79,85,86
985,male,group A,high school,standard,none,57,51,54
987,male,group E,some high school,standard,completed,81,75,76
994,male,group A,high school,standard,none,63,63,62

In [64]:
data.query('`race/ethnicity` == "group B"') # `` which is used for make the condition safe for some special characters

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
2,female,group B,master's degree,standard,none,90,95,93
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
7,male,group B,some college,free/reduced,none,40,43,39
...,...,...,...,...,...,...,...,...
969,female,group B,bachelor's degree,standard,none,75,84,80
976,male,group B,some college,free/reduced,completed,60,62,60
980,female,group B,high school,free/reduced,none,8,24,23
982,male,group B,some high school,standard,completed,79,85,86
991,female,group B,some high school,standard,completed,65,82,78

# Data Cleaning

### NaN -> not a number
### None -> null value
### ''
### Duplicate records

###                        |
###                        |

### finding the null values fill,replace,null values renaming the duplicate values

In [22]:
import numpy as np
df = pd.DataFrame({'col1':[1,2,3,np.nan,4,5],'col2':[11,23,None,None,100,20]})
df

   col1   col2
0   1.0   11.0
1   2.0   23.0
2   3.0    NaN
3   NaN    NaN
4   4.0  100.0
5   5.0   20.0

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    5 non-null      float64
 1   col2    4 non-null      float64
dtypes: float64(2)
memory usage: 228.0 bytes

### isna()/isnull()
### it is built in method used to get null values from a dataset

### syntax:-

### dataframe.isna() / dataframe.isnull()
### returns boolean values
### returns True if the values are NaN or NUll else False

### used to check it is none or nan if present it will returns TRUE

In [8]:
df.isna()

    col1   col2
0  False  False
1  False  False
2  False   True
3   True   True
4  False  False
5  False  False

In [23]:
df.isna().sum()

col1    1
col2    2
dtype: int64

In [24]:
df.isnull()

    col1   col2
0  False  False
1  False  False
2  False   True
3   True   True
4  False  False
5  False  False

### dataframe.dropna() --> which is used to drop the NaN values

### it is buit in method which is used to remove rows if it is having NaN(null values)

### if any column having NaN it removes/deletes the entire row by default

In [25]:
df.dropna()

   col1   col2
0   1.0   11.0
1   2.0   23.0
4   4.0  100.0
5   5.0   20.0

In [26]:
df.dropna(subset=['col1'])
# it is not updating it is returning new dataframe

   col1   col2
0   1.0   11.0
1   2.0   23.0
2   3.0    NaN
4   4.0  100.0
5   5.0   20.0

## Updating dataframe

### how to update the dropna records by default 
### dataframe.dropna(inplace=True)

In [27]:
df = df.dropna()
df

   col1   col2
0   1.0   11.0
1   2.0   23.0
4   4.0  100.0
5   5.0   20.0

In [ ]:
import numpy as np
df = pd.DataFrame({'col1':[1,2,3,np.nan,4,5],'col2':[11,23,None,None,100,20]})

df.dropna(inplace=True) # this is another way to update the dataframe
df

   col1   col2
0   1.0   11.0
1   2.0   23.0
4   4.0  100.0
5   5.0   20.0

In [35]:
import numpy as np
df = pd.DataFrame({'col1':[1,2,3,np.nan,4,5],'col2':[11,23,None,None,100,20]})

df.dropna(subset=['col1','col2'],how='all') 
df
# this is 3rd way to update the dataframe if from the entire rows have null it removes 
# if from the any one coloumn have values then it won't reomve if we want to remove if any one have null value than we use 'any'
# by default 'any' or forcefully need to give all based on the scenarios and column importance we will give 'any' or 'all'

   col1   col2
0   1.0   11.0
1   2.0   23.0
2   3.0    NaN
3   NaN    NaN
4   4.0  100.0
5   5.0   20.0